In [2]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('../Data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [7]:
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [8]:
#p28 parse_cols은 deprecated -> usecols로 변경 
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', header=2, usecols = 'B,D,G,J,N', encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [9]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별'
                         ,pop_Seoul.columns[1]:'인구수'
                         ,pop_Seoul.columns[2]:'한국인'
                         ,pop_Seoul.columns[3]:'외국인'
                         ,pop_Seoul.columns[4]:'고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [10]:
#1-3 pandas 기초 익히기
import pandas as pd
import numpy as np

In [11]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976

In [14]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[-0.40247027, -1.62674662, -0.24694436,  0.54889828],
       [-0.7249437 , -0.52942125, -1.43453504, -0.59973574],
       [-0.28979408, -1.02225069,  0.06417168,  1.88231608],
       [-0.96663728,  0.23745947, -1.54830377, -2.05041107],
       [-0.70221464, -0.51750959, -1.35267595, -0.12742156],
       [-1.52824208, -1.09375398, -0.7991523 , -1.49097561]])

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.769050 -0.758704 -0.886240 -0.306222
std    0.444048  0.638483  0.674698  1.420203
min   -1.528242 -1.626747 -1.548304 -2.050411
25%   -0.906214 -1.075878 -1.414070 -1.268166
50%   -0.713579 -0.775836 -1.075914 -0.363579
75%   -0.477406 -0.520488 -0.384996  0.379818
max   -0.289794  0.237459  0.064172  1.882316

In [20]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898

In [21]:
df

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976

In [22]:
df['A']

2013-01-01   -0.402470
2013-01-02   -0.724944
2013-01-03   -0.289794
2013-01-04   -0.966637
2013-01-05   -0.702215
2013-01-06   -1.528242
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411

In [25]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316

In [26]:
df.loc[dates[0]]

A   -0.402470
B   -1.626747
C   -0.246944
D    0.548898
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.402470 -1.626747
2013-01-02 -0.724944 -0.529421
2013-01-03 -0.289794 -1.022251
2013-01-04 -0.966637  0.237459
2013-01-05 -0.702215 -0.517510
2013-01-06 -1.528242 -1.093754

In [28]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.724944 -0.529421
2013-01-03 -0.289794 -1.022251
2013-01-04 -0.966637  0.237459

In [29]:
df.loc['20130102',['A','B']]

A   -0.724944
B   -0.529421
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

-0.402470273178129

In [31]:
df.iloc[3]

A   -0.966637
B    0.237459
C   -1.548304
D   -2.050411
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.966637  0.237459
2013-01-05 -0.702215 -0.517510

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.724944 -1.434535
2013-01-03 -0.289794  0.064172
2013-01-05 -0.702215 -1.352676

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.626747 -0.246944
2013-01-02 -0.529421 -1.434535
2013-01-03 -1.022251  0.064172
2013-01-04  0.237459 -1.548304
2013-01-05 -0.517510 -1.352676
2013-01-06 -1.093754 -0.799152

In [36]:
df

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976

In [37]:
df[df.A > 0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [38]:
df[df>0]

             A         B         C         D
2013-01-01 NaN       NaN       NaN  0.548898
2013-01-02 NaN       NaN       NaN       NaN
2013-01-03 NaN       NaN  0.064172  1.882316
2013-01-04 NaN  0.237459       NaN       NaN
2013-01-05 NaN       NaN       NaN       NaN
2013-01-06 NaN       NaN       NaN       NaN

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one', 'two', 'tree', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898    one
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736    one
2013-01-03 -0.289794 -1.022251  0.064172  1.882316    two
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411   tree
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422   four
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976  three

In [41]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [42]:
df[df2['E'].isin(['two','four'])]

                   A         B         C         D
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422

In [43]:
df

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -0.724944 -0.529421 -1.434535 -0.599736
2013-01-03 -0.289794 -1.022251  0.064172  1.882316
2013-01-04 -0.966637  0.237459 -1.548304 -2.050411
2013-01-05 -0.702215 -0.517510 -1.352676 -0.127422
2013-01-06 -1.528242 -1.093754 -0.799152 -1.490976

In [44]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.402470 -1.626747 -0.246944  0.548898
2013-01-02 -1.127414 -2.156168 -1.681479 -0.050837
2013-01-03 -1.417208 -3.178419 -1.617308  1.831479
2013-01-04 -2.383845 -2.940959 -3.165611 -0.218932
2013-01-05 -3.086060 -3.458469 -4.518287 -0.346354
2013-01-06 -4.614302 -4.552223 -5.317440 -1.837330

In [45]:
df.apply(lambda x: x.max() - x.min())

A    1.238448
B    1.864206
C    1.612475
D    3.932727
dtype: float64

In [46]:
#day02
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [47]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [48]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [49]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년']+CCTV_Seoul['2015년']+CCTV_Seoul['2014년'])/CCTV_Seoul['2013년도 이전']*100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [50]:
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [51]:
pop_Seoul.drop([0],inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [52]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [53]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [54]:
pop_Seoul.drop([26],inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [55]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [56]:
pop_Seoul.sort_values(by='인구수', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [57]:
pop_Seoul.sort_values(by='외국인', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [58]:
pop_Seoul.sort_values(by='외국인비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [59]:
pop_Seoul.sort_values(by='고령자', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [60]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

In [61]:
## 1.5
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index=[4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                    index=[8,9,10,11])

In [62]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [64]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [65]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                    'D':['D2','D3','D6','D7'],
                    'F':['F2','F3','F6','F7']},
                    index=[2,3,6,7])
result = pd.concat([df1,df4],axis=1)

In [66]:
result = pd.concat([df1,df4],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [67]:
result = pd.concat([df1,df4],axis=1,join_axes=[df1.index])
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [68]:
result = pd.concat([df1,df4],ignore_index=True,sort=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [69]:
left = pd.DataFrame({'key':['K0','K4','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

In [70]:
pd.merge(left,right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [71]:
pd.merge(left,right,how='outer',on='key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [72]:
##1-6
data_result = pd.merge(CCTV_Seoul, pop_Seoul, on='구별')
data_result.head()

,구별,소계,2013년도 이전,2014년,2015년,2016년,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,1292,430,584,932,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,379,99,155,377,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,369,120,138,204,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,388,258,184,81,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,846,260,390,613,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [73]:
del data_result['2013년도 이전']
del data_result['2014년']
del data_result['2015년']
del data_result['2016년']
data_result.head()

,구별,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [74]:
data_result.set_index('구별',inplace=True)
data_result.head()

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [75]:
np.corrcoef(data_result['고령자비율'],data_result['소계'])

array([[ 1.        , -0.28078554],
       [-0.28078554,  1.        ]])

In [76]:
np.corrcoef(data_result['외국인비율'],data_result['소계'])

array([[ 1.        , -0.13607433],
       [-0.13607433,  1.        ]])

In [77]:
np.corrcoef(data_result['인구수'],data_result['소계'])

array([[1.        , 0.30634228],
       [0.30634228, 1.        ]])

In [78]:
data_result.sort_values(by='소계',ascending=False).head(5)

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
양천구,2034,34.671731,479978.0,475949.0,4029.0,52975.0,0.839413,11.036964
서초구,1930,63.371266,450310.0,445994.0,4316.0,51733.0,0.958451,11.488308
은평구,1873,85.237258,494388.0,489943.0,4445.0,72334.0,0.899091,14.631019
용산구,1624,53.216374,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427